rofiqcp/Praktikum-Sistem-Embedded/Modul-09-FreeRTOS-Task/praktikum/STM32/STM32_02_Task_Priority/src/main.c
/**
 * ============================================================================
 * PROGRAM 02: Task Priority - Demonstrasi Prioritas & Preemption FreeRTOS
 * ============================================================================
 * 
 * Deskripsi:
 *   Program ini mendemonstrasikan mekanisme prioritas task dan preemptive
 *   scheduling pada FreeRTOS. Tiga task dengan prioritas berbeda (Low=1,
 *   Medium=3, High=5) melakukan CPU-intensive work, dan kita mengamati
 *   bagaimana scheduler memberikan CPU kepada task berprioritas tinggi.
 * 
 * Konsep yang Dipelajari:
 *   1. Preemptive Scheduling - Task prioritas tinggi mengambil alih CPU
 *   2. vTaskPrioritySet()    - Mengubah prioritas task saat runtime
 *   3. uxTaskPriorityGet()   - Membaca prioritas task saat ini
 *   4. CPU Time Distribution - Bagaimana CPU dibagi antar task
 *   5. Priority Inversion    - Potensi masalah pada sistem prioritas
 * 
 * Arsitektur Fase:
 *   Fase 1 (8 detik): Prioritas normal → Low=1, Med=3, High=5
 *   Fase 2 (8 detik): Prioritas ditukar → Low=5, Med=3, High=1
 *   Fase 3 (8 detik): Prioritas dikembalikan → Low=1, Med=3, High=5
 *   (Berulang)
 * 
 * Hardware:
 *   - STM32F103C8 Blue Pill (72 MHz, 20KB SRAM)
 *   - LED PC13: Indikator Task Medium
 *   - LED PB0:  Indikator Task Low
 *   - LED PB1:  Indikator Task High
 *   - USART1: PA9(TX)/PA10(RX) @ 115200 baud
 * 
 * Output Format (untuk Python parser):
 *   [DATA]EXEC,<nama_task>,<prioritas>,<elapsed_us>,<iteration>,<tick>
 *   [DATA]PHASE,<nomor_fase>,<deskripsi>,<tick>
 *   [DATA]PRIORITY,<nama>,<old_prio>,<new_prio>,<tick>
 *   [DATA]ORDER,<urutan_eksekusi>,<tick>
 * 
 * ============================================================================
 */

/* ========================== HEADER INCLUDES ============================== */
#include "stm32f1xx_hal.h"
#include "FreeRTOS.h"
#include "task.h"
#include "config.h"
#include <stdio.h>
#include <string.h>

/* ======================== VARIABEL GLOBAL ================================ */

/* Handle UART */
static UART_HandleTypeDef huart1;

/* Handle task FreeRTOS */
static TaskHandle_t xTaskLowHandle   = NULL;
static TaskHandle_t xTaskMedHandle   = NULL;
static TaskHandle_t xTaskHighHandle  = NULL;
static TaskHandle_t xMonitorHandle   = NULL;

/* Flag scheduler sudah berjalan */
static volatile uint8_t ucSchedulerStarted = 0;

/**
 * Struktur data untuk mencatat eksekusi task
 * Setiap task memiliki counter dan timing sendiri
 */
typedef struct {
    uint32_t ulExecutionCount;      /* Jumlah kali task menyelesaikan work   */
    uint32_t ulLastElapsedUs;       /* Waktu eksekusi terakhir (mikrodetik)  */
    uint32_t ulTotalElapsedUs;      /* Total waktu eksekusi kumulatif        */
    uint32_t ulMinElapsedUs;        /* Waktu eksekusi minimum                */
    uint32_t ulMaxElapsedUs;        /* Waktu eksekusi maksimum               */
    UBaseType_t uxCurrentPriority;  /* Prioritas saat ini                    */
    TickType_t xLastCompleteTick;   /* Tick saat task terakhir selesai       */
} TaskStats_t;

static volatile TaskStats_t xTaskLowStats  = {0, 0, 0, 0xFFFFFFFF, 0, TASK_LOW_PRIORITY, 0};
static volatile TaskStats_t xTaskMedStats  = {0, 0, 0, 0xFFFFFFFF, 0, TASK_MED_PRIORITY, 0};
static volatile TaskStats_t xTaskHighStats = {0, 0, 0, 0xFFFFFFFF, 0, TASK_HIGH_PRIORITY, 0};

/**
 * Fase saat ini (1, 2, atau 3)
 * Volatile karena diubah oleh monitor task dan dibaca oleh worker task
 */
static volatile uint8_t ucCurrentPhase = 1;

/**
 * Array untuk mencatat urutan eksekusi task
 * 'L' = Low, 'M' = Medium, 'H' = High
 */
#define EXEC_ORDER_SIZE  64
static volatile char cExecOrder[EXEC_ORDER_SIZE];
static volatile uint8_t ucExecOrderIdx = 0;

/* Buffer print */
static char pcPrintBuffer[PRINT_BUFFER_SIZE];

/* DWT Cycle Counter untuk pengukuran presisi */
#define DWT_CONTROL     (*((volatile uint32_t*)0xE0001000))
#define DWT_CYCCNT      (*((volatile uint32_t*)0xE0001004))
#define SCB_DEMCR       (*((volatile uint32_t*)0xE000EDFC))
#define TRCENA_BIT      (1UL << 24)

/* ==================== DEKLARASI FUNGSI PROTOTYPE ========================= */
static void SystemClock_Config(void);
static void GPIO_Init(void);
static void UART1_Init(void);
static void DWT_Init(void);
static uint32_t DWT_GetCycles(void);

static void vTaskLow(void *pvParameters);
static void vTaskMed(void *pvParameters);
static void vTaskHigh(void *pvParameters);
static void vTaskMonitor(void *pvParameters);

static void vDoWork(const char *pcName, TaskStats_t volatile *pxStats, 
                    GPIO_TypeDef *pLedPort, uint16_t usLedPin);
static void vRecordExecOrder(char cTaskId);
static void vPrintSeparator(char cChar, uint8_t ucLen);
static const char* pcTaskStateToString(eTaskState eState);

/* ========================= RETARGET PRINTF =============================== */
int _write(int file, char *ptr, int len) {
    (void)file;
    HAL_UART_Transmit(&huart1, (uint8_t*)ptr, len, HAL_MAX_DELAY);
    return len;
}

/* ===================== INTERRUPT HANDLERS ================================ */
void SysTick_Handler(void) {
    HAL_IncTick();
    if (ucSchedulerStarted) {
        xPortSysTickHandler();
    }
}

/* =================== HOOK FUNCTIONS FreeRTOS ============================= */

void vApplicationMallocFailedHook(void) {
    printf("\r\n[ERROR] !! MALLOC GAGAL !!\r\n");
    taskDISABLE_INTERRUPTS();
    for (;;) {
        HAL_GPIO_TogglePin(LED_BUILTIN_PORT, LED_BUILTIN_PIN);
        for (volatile uint32_t i = 0; i < 200000; i++);
    }
}

void vApplicationStackOverflowHook(TaskHandle_t xTask, char *pcTaskName) {
    (void)xTask;
    printf("\r\n[ERROR] !! STACK OVERFLOW: %s !!\r\n", pcTaskName);
    taskDISABLE_INTERRUPTS();
    for (;;) {
        HAL_GPIO_TogglePin(LED_BUILTIN_PORT, LED_BUILTIN_PIN);
        for (volatile uint32_t i = 0; i < 100000; i++);
    }
}

void vApplicationGetIdleTaskMemory(StaticTask_t **ppxIdleTaskTCBBuffer,
                                   StackType_t **ppxIdleTaskStackBuffer,
                                   uint32_t *pulIdleTaskStackSize) {
    static StaticTask_t xIdleTaskTCB;
    static StackType_t uxIdleTaskStack[configMINIMAL_STACK_SIZE];
    *ppxIdleTaskTCBBuffer   = &xIdleTaskTCB;
    *ppxIdleTaskStackBuffer = uxIdleTaskStack;
    *pulIdleTaskStackSize   = configMINIMAL_STACK_SIZE;
}

void vApplicationGetTimerTaskMemory(StaticTask_t **ppxTimerTaskTCBBuffer,
                                    StackType_t **ppxTimerTaskStackBuffer,
                                    uint32_t *pulTimerTaskStackSize) {
    static StaticTask_t xTimerTaskTCB;
    static StackType_t uxTimerTaskStack[configTIMER_TASK_STACK_DEPTH];
    *ppxTimerTaskTCBBuffer   = &xTimerTaskTCB;
    *ppxTimerTaskStackBuffer = uxTimerTaskStack;
    *pulTimerTaskStackSize   = configTIMER_TASK_STACK_DEPTH;
}

/* ==================== KONFIGURASI SYSTEM CLOCK =========================== */

/**
 * Konfigurasi Clock: HSE 8MHz → PLL x9 → SYSCLK 72MHz
 */
static void SystemClock_Config(void) {
    RCC_OscInitTypeDef RCC_OscInitStruct = {0};
    RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

    RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
    RCC_OscInitStruct.HSEState       = RCC_HSE_ON;
    RCC_OscInitStruct.HSEPredivValue = RCC_HSE_PREDIV_DIV1;
    RCC_OscInitStruct.PLL.PLLState   = RCC_PLL_ON;
    RCC_OscInitStruct.PLL.PLLSource  = RCC_PLLSOURCE_HSE;
    RCC_OscInitStruct.PLL.PLLMUL     = RCC_PLL_MUL9;

    if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK) {
        for (;;);
    }

