rofiqcp/Praktikum-Sistem-Embedded/Modul-09-FreeRTOS-Task/praktikum/STM32/STM32_02_Task_Priority/src/main.c
    RCC_ClkInitStruct.ClockType      = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK |
                                       RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
    RCC_ClkInitStruct.SYSCLKSource   = RCC_SYSCLKSOURCE_PLLCLK;
    RCC_ClkInitStruct.AHBCLKDivider  = RCC_SYSCLK_DIV1;
    RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
    RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

    if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK) {
        for (;;);
    }
}

/* ======================== INISIALISASI GPIO ============================== */

static void GPIO_Init(void) {
    GPIO_InitTypeDef GPIO_InitStruct = {0};

    /* Aktifkan clock GPIO */
    LED_BUILTIN_CLK_EN();
    LED_LOW_CLK_EN();
    LED_HIGH_CLK_EN();
    BTN_CLK_EN();

    /* LED Built-in PC13 (active LOW) - Indikator Task Medium */
    GPIO_InitStruct.Pin   = LED_BUILTIN_PIN;
    GPIO_InitStruct.Mode  = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull  = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(LED_BUILTIN_PORT, &GPIO_InitStruct);
    HAL_GPIO_WritePin(LED_BUILTIN_PORT, LED_BUILTIN_PIN, GPIO_PIN_SET);

    /* LED PB0 - Indikator Task Low */
    GPIO_InitStruct.Pin = LED_LOW_PIN;
    HAL_GPIO_Init(LED_LOW_PORT, &GPIO_InitStruct);
    HAL_GPIO_WritePin(LED_LOW_PORT, LED_LOW_PIN, GPIO_PIN_RESET);

    /* LED PB1 - Indikator Task High */
    GPIO_InitStruct.Pin = LED_HIGH_PIN;
    HAL_GPIO_Init(LED_HIGH_PORT, &GPIO_InitStruct);
    HAL_GPIO_WritePin(LED_HIGH_PORT, LED_HIGH_PIN, GPIO_PIN_RESET);

    /* Tombol PA0 */
    GPIO_InitStruct.Pin  = BTN_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
    GPIO_InitStruct.Pull = GPIO_PULLUP;
    HAL_GPIO_Init(BTN_PORT, &GPIO_InitStruct);
}

/* ======================== INISIALISASI UART ============================== */

static void UART1_Init(void) {
    UART_CLK_EN();
    UART_GPIO_CLK_EN();

    GPIO_InitTypeDef GPIO_InitStruct = {0};
    GPIO_InitStruct.Pin   = UART_TX_PIN;
    GPIO_InitStruct.Mode  = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(UART_TX_PORT, &GPIO_InitStruct);

    GPIO_InitStruct.Pin  = UART_RX_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_INPUT;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    HAL_GPIO_Init(UART_RX_PORT, &GPIO_InitStruct);

    huart1.Instance          = UART_INSTANCE;
    huart1.Init.BaudRate     = UART_BAUDRATE;
    huart1.Init.WordLength   = UART_WORDLENGTH_8B;
    huart1.Init.StopBits     = UART_STOPBITS_1;
    huart1.Init.Parity       = UART_PARITY_NONE;
    huart1.Init.Mode         = UART_MODE_TX_RX;
    huart1.Init.HwFlowCtl    = UART_HWCONTROL_NONE;
    huart1.Init.OverSampling = UART_OVERSAMPLING_16;

    if (HAL_UART_Init(&huart1) != HAL_OK) {
        for (;;);
    }
}

/* ========================== DWT INIT ===================================== */

/**
 * Inisialisasi DWT (Data Watchpoint and Trace) Cycle Counter
 * 
 * DWT CYCCNT adalah counter 32-bit yang menghitung siklus clock CPU.
 * Pada 72 MHz, satu siklus ≈ 13.9 ns, memberikan resolusi sangat tinggi.
 * Counter overflow setelah ~59.6 detik pada 72 MHz.
 * 
 * Digunakan untuk mengukur waktu eksekusi CPU work secara presisi.
 */
static void DWT_Init(void) {
    SCB_DEMCR |= TRCENA_BIT;       /* Aktifkan trace module             */
    DWT_CYCCNT  = 0;                /* Reset counter                     */
    DWT_CONTROL |= 1;               /* Aktifkan cycle counter            */
}

/**
 * Baca nilai DWT cycle counter saat ini
 * @return Jumlah siklus clock sejak counter direset/overflow
 */
static uint32_t DWT_GetCycles(void) {
    return DWT_CYCCNT;
}

/* ========================= UTILITY FUNCTIONS ============================= */

static void vPrintSeparator(char cChar, uint8_t ucLen) {
    for (uint8_t i = 0; i < ucLen; i++) printf("%c", cChar);
    printf("\r\n");
}

static const char* pcTaskStateToString(eTaskState eState) {
    switch (eState) {
        case eRunning:   return "RUNNING";
        case eReady:     return "READY";
        case eBlocked:   return "BLOCKED";
        case eSuspended: return "SUSPENDED";
        case eDeleted:   return "DELETED";
        default:         return "UNKNOWN";
    }
}

/**
 * Catat urutan eksekusi task ke dalam array
 * 
 * Fungsi ini dipanggil oleh setiap worker task setelah menyelesaikan
 * satu unit pekerjaan. Hasilnya adalah string seperti "HHMHLMH..."
 * yang menunjukkan urutan task yang mendapat CPU time.
 * 
 * @param cTaskId  Karakter identifikasi task ('L', 'M', atau 'H')
 */
static void vRecordExecOrder(char cTaskId) {
    if (ucExecOrderIdx < EXEC_ORDER_SIZE - 1) {
        cExecOrder[ucExecOrderIdx++] = cTaskId;
        cExecOrder[ucExecOrderIdx]   = '\0';
    }
}

/* ====================== CPU WORK FUNCTION ================================ */

/**
 * Simulasi beban kerja CPU (CPU-bound work)
 * 
 * Fungsi ini melakukan loop counting sebanyak CPU_WORK_ITERATIONS kali,
 * mensimulasikan task yang membutuhkan waktu CPU signifikan.
 * 
 * Mengukur waktu eksekusi menggunakan DWT cycle counter dan
 * mengirim data via UART untuk analisis.
 * 
 * Pada preemptive scheduling:
 *   - Task High (prio 5) akan preempt task Low/Med saat ready
 *   - Task Med (prio 3) akan preempt task Low saat ready
 *   - Task Low (prio 1) hanya berjalan saat task lain blocked
 * 
 * @param pcName    Nama task untuk identifikasi
 * @param pxStats   Pointer ke struktur statistik task
 * @param pLedPort  Port GPIO LED indikator
 * @param usLedPin  Pin GPIO LED indikator
 */
static void vDoWork(const char *pcName, TaskStats_t volatile *pxStats,
                    GPIO_TypeDef *pLedPort, uint16_t usLedPin) {
    /* Nyalakan LED saat task mulai bekerja */
    HAL_GPIO_WritePin(pLedPort, usLedPin, GPIO_PIN_SET);

    /* Ambil timestamp awal menggunakan DWT */
    uint32_t ulStartCycles = DWT_GetCycles();

    /* Simulasi beban kerja CPU - loop counting */
    volatile uint32_t ulCounter = 0;
    for (uint32_t i = 0; i < CPU_WORK_ITERATIONS; i++) {
        ulCounter++;
    }

