rofiqcp/Praktikum-Sistem-Embedded/Modul-09-FreeRTOS-Task/praktikum/STM32/STM32_02_Task_Priority/src/main.c
    /* Ambil timestamp akhir */
    uint32_t ulEndCycles = DWT_GetCycles();

    /* Hitung waktu elapsed dalam mikrodetik */
    uint32_t ulElapsedCycles = ulEndCycles - ulStartCycles;
    uint32_t ulElapsedUs = ulElapsedCycles / SYSTEM_CLOCK_MHZ;

    /* Update statistik task */
    pxStats->ulExecutionCount++;
    pxStats->ulLastElapsedUs = ulElapsedUs;
    pxStats->ulTotalElapsedUs += ulElapsedUs;
    pxStats->uxCurrentPriority = uxTaskPriorityGet(NULL);
    pxStats->xLastCompleteTick = xTaskGetTickCount();

    if (ulElapsedUs < pxStats->ulMinElapsedUs) {
        pxStats->ulMinElapsedUs = ulElapsedUs;
    }
    if (ulElapsedUs > pxStats->ulMaxElapsedUs) {
        pxStats->ulMaxElapsedUs = ulElapsedUs;
    }

    /* Matikan LED setelah selesai bekerja */
    HAL_GPIO_WritePin(pLedPort, usLedPin, GPIO_PIN_RESET);

    /* Cetak hasil eksekusi */
    printf("[%s] Selesai #%lu | Elapsed: %lu us | Prio: %lu | Phase: %u\r\n",
           pcName,
           (unsigned long)pxStats->ulExecutionCount,
           (unsigned long)ulElapsedUs,
           (unsigned long)pxStats->uxCurrentPriority,
           ucCurrentPhase);

    /* Data untuk Python parser */
    printf("[DATA]EXEC,%s,%lu,%lu,%lu,%lu\r\n",
           pcName,
           (unsigned long)pxStats->uxCurrentPriority,
           (unsigned long)ulElapsedUs,
           (unsigned long)pxStats->ulExecutionCount,
           (unsigned long)xTaskGetTickCount());
}

/* ========================== TASK FUNCTIONS =============================== */

/**
 * Task Low Priority (Prioritas 1)
 * 
 * Task ini memiliki prioritas terendah di antara worker tasks.
 * Dalam mode preemptive:
 *   - Akan di-preempt oleh Task Med dan Task High
 *   - Hanya mendapat CPU time saat kedua task lain sedang blocked
 *   - Waktu eksekusi terukur lebih lama karena preemption
 * 
 * Saat prioritas ditukar (Fase 2):
 *   - Prioritas berubah menjadi 5 (tertinggi)
 *   - Akan mendapat CPU time terlebih dahulu
 *   - Waktu eksekusi terukur menjadi lebih singkat (tanpa preemption)
 */
static void vTaskLow(void *pvParameters) {
    (void)pvParameters;

    printf("[%s] Task dimulai - Prioritas: %d\r\n", TASK_LOW_NAME, TASK_LOW_PRIORITY);

    for (;;) {
        /* Lakukan CPU-intensive work */
        vDoWork(TASK_LOW_NAME, &xTaskLowStats, 
                TASK_LOW_LED_PORT, TASK_LOW_LED_PIN);

        /* Catat urutan eksekusi */
        vRecordExecOrder('L');

        /* Delay sebelum iterasi berikutnya */
        vTaskDelay(pdMS_TO_TICKS(TASK_WORK_PERIOD_MS));
    }
}

/**
 * Task Medium Priority (Prioritas 3)
 * 
 * Task ini berada di tengah hierarki prioritas.
 * Dalam mode preemptive:
 *   - Akan di-preempt oleh Task High
 *   - Akan mem-preempt Task Low
 *   - Mendapat CPU time setelah Task High selesai/blocked
 */
static void vTaskMed(void *pvParameters) {
    (void)pvParameters;

    printf("[%s] Task dimulai - Prioritas: %d\r\n", TASK_MED_NAME, TASK_MED_PRIORITY);

    for (;;) {
        vDoWork(TASK_MED_NAME, &xTaskMedStats,
                TASK_MED_LED_PORT, TASK_MED_LED_PIN);

        vRecordExecOrder('M');

        vTaskDelay(pdMS_TO_TICKS(TASK_WORK_PERIOD_MS));
    }
}

/**
 * Task High Priority (Prioritas 5)
 * 
 * Task ini memiliki prioritas tertinggi di antara worker tasks.
 * Dalam mode preemptive:
 *   - Tidak pernah di-preempt oleh worker task lain
 *   - Selalu mendapat CPU terlebih dahulu saat ready
 *   - Waktu eksekusi terukur paling konsisten (tanpa interupsi)
 */
static void vTaskHigh(void *pvParameters) {
    (void)pvParameters;

    printf("[%s] Task dimulai - Prioritas: %d\r\n", TASK_HIGH_NAME, TASK_HIGH_PRIORITY);

    for (;;) {
        vDoWork(TASK_HIGH_NAME, &xTaskHighStats,
                TASK_HIGH_LED_PORT, TASK_HIGH_LED_PIN);

        vRecordExecOrder('H');

        vTaskDelay(pdMS_TO_TICKS(TASK_WORK_PERIOD_MS));
    }
}

/**
 * Task Monitor: Mengelola fase dan mencetak statistik
 * 
 * Task ini bertanggung jawab untuk:
 *   1. Mengubah fase (Normal → Swap → Restore)
 *   2. Mengubah prioritas task saat pergantian fase
 *   3. Mencetak statistik eksekusi detail
 *   4. Mencetak urutan eksekusi untuk analisis
 * 
 * Prioritas: 6 (tertinggi, agar selalu bisa mengontrol fase)
 */
static void vTaskMonitor(void *pvParameters) {
    (void)pvParameters;

    TickType_t xPhaseStartTick = xTaskGetTickCount();
    uint32_t ulMonitorCycle = 0;

    printf("[%s] Task monitor dimulai - Prioritas: %d\r\n",
           MONITOR_TASK_NAME, MONITOR_PRIORITY);

    for (;;) {
        ulMonitorCycle++;
        TickType_t xCurrentTick = xTaskGetTickCount();
        uint32_t ulElapsedMs = (xCurrentTick - xPhaseStartTick) * 
                               (1000 / configTICK_RATE_HZ);

        /* ---- Cek apakah waktunya berganti fase ---- */
        if (ulElapsedMs >= PHASE_DURATION_MS) {
            xPhaseStartTick = xCurrentTick;

            /* Reset urutan eksekusi */
            ucExecOrderIdx = 0;
            cExecOrder[0] = '\0';

            /* Tentukan fase berikutnya */
            ucCurrentPhase++;
            if (ucCurrentPhase > TOTAL_PHASES) {
                ucCurrentPhase = 1;
            }

            printf("\r\n");
            vPrintSeparator('*', 65);

            switch (ucCurrentPhase) {
                case 1: {
                    /* Fase 1: Prioritas Normal */
                    printf(">>> FASE 1: Prioritas Normal (Low=1, Med=3, High=5)\r\n");

                    UBaseType_t uxOldLow  = uxTaskPriorityGet(xTaskLowHandle);
                    UBaseType_t uxOldHigh = uxTaskPriorityGet(xTaskHighHandle);

                    vTaskPrioritySet(xTaskLowHandle,  TASK_LOW_PRIORITY);
                    vTaskPrioritySet(xTaskMedHandle,   TASK_MED_PRIORITY);
                    vTaskPrioritySet(xTaskHighHandle,  TASK_HIGH_PRIORITY);

                    printf("[DATA]PRIORITY,%s,%lu,%d,%lu\r\n", TASK_LOW_NAME,
                           (unsigned long)uxOldLow, TASK_LOW_PRIORITY,
                           (unsigned long)xCurrentTick);
                    printf("[DATA]PRIORITY,%s,%lu,%d,%lu\r\n", TASK_HIGH_NAME,
                           (unsigned long)uxOldHigh, TASK_HIGH_PRIORITY,
                           (unsigned long)xCurrentTick);
                    printf("[DATA]PHASE,1,Normal,%lu\r\n", (unsigned long)xCurrentTick);
                    break;
                }

                case 2: {
                    /**
                     * Fase 2: Tukar Prioritas
                     * 
                     * vTaskPrioritySet() - Mengubah prioritas task saat runtime
                     * 
                     * Ketika prioritas task diubah:
                     *   - Jika prioritas baru > prioritas task yang sedang berjalan:
                     *     → Context switch terjadi segera (preemption)
                     *   - Jika prioritas baru < prioritas saat ini:
                     *     → Task tetap berjalan sampai yield/block/preempted
                     * 
                     * Di sini kita menukar prioritas Low dan High:
                     *   Low: 1 → 5 (menjadi tertinggi)
                     *   High: 5 → 1 (menjadi terendah)
                     */
                    printf(">>> FASE 2: Tukar Prioritas (Low=5, Med=3, High=1)\r\n");

                    UBaseType_t uxOldLow  = uxTaskPriorityGet(xTaskLowHandle);
                    UBaseType_t uxOldHigh = uxTaskPriorityGet(xTaskHighHandle);

