rofiqcp/Praktikum-Sistem-Embedded/Modul-09-FreeRTOS-Task/praktikum/STM32/STM32_02_Task_Priority/src/main.c
                    /* Tukar prioritas Low dan High */
                    vTaskPrioritySet(xTaskLowHandle,  TASK_HIGH_PRIORITY);
                    vTaskPrioritySet(xTaskHighHandle,  TASK_LOW_PRIORITY);

                    printf("  %s: %lu → %d\r\n", TASK_LOW_NAME,
                           (unsigned long)uxOldLow, TASK_HIGH_PRIORITY);
                    printf("  %s: %lu → %d\r\n", TASK_HIGH_NAME,
                           (unsigned long)uxOldHigh, TASK_LOW_PRIORITY);

                    printf("[DATA]PRIORITY,%s,%lu,%d,%lu\r\n", TASK_LOW_NAME,
                           (unsigned long)uxOldLow, TASK_HIGH_PRIORITY,
                           (unsigned long)xCurrentTick);
                    printf("[DATA]PRIORITY,%s,%lu,%d,%lu\r\n", TASK_HIGH_NAME,
                           (unsigned long)uxOldHigh, TASK_LOW_PRIORITY,
                           (unsigned long)xCurrentTick);
                    printf("[DATA]PHASE,2,Swapped,%lu\r\n", (unsigned long)xCurrentTick);
                    break;
                }

                case 3: {
                    /* Fase 3: Kembalikan Prioritas */
                    printf(">>> FASE 3: Restore Prioritas (Low=1, Med=3, High=5)\r\n");

                    UBaseType_t uxOldLow  = uxTaskPriorityGet(xTaskLowHandle);
                    UBaseType_t uxOldHigh = uxTaskPriorityGet(xTaskHighHandle);

                    vTaskPrioritySet(xTaskLowHandle,  TASK_LOW_PRIORITY);
                    vTaskPrioritySet(xTaskMedHandle,   TASK_MED_PRIORITY);
                    vTaskPrioritySet(xTaskHighHandle,  TASK_HIGH_PRIORITY);

                    printf("[DATA]PRIORITY,%s,%lu,%d,%lu\r\n", TASK_LOW_NAME,
                           (unsigned long)uxOldLow, TASK_LOW_PRIORITY,
                           (unsigned long)xCurrentTick);
                    printf("[DATA]PRIORITY,%s,%lu,%d,%lu\r\n", TASK_HIGH_NAME,
                           (unsigned long)uxOldHigh, TASK_HIGH_PRIORITY,
                           (unsigned long)xCurrentTick);
                    printf("[DATA]PHASE,3,Restored,%lu\r\n", (unsigned long)xCurrentTick);
                    break;
                }
            }
            vPrintSeparator('*', 65);
        }

        /* ---- Cetak Statistik Periodik ---- */
        printf("\r\n");
        vPrintSeparator('=', 65);
        printf("  MONITOR SIKLUS #%lu | Fase: %u | Tick: %lu\r\n",
               (unsigned long)ulMonitorCycle, ucCurrentPhase,
               (unsigned long)xCurrentTick);
        vPrintSeparator('-', 65);

        /* Header tabel statistik */
        printf("  %-12s | Prio | Count | Last(us) | Min(us) | Max(us) | Stack\r\n",
               "Task");
        vPrintSeparator('-', 65);

        /* Statistik Task Low */
        printf("  %-12s | %4lu | %5lu | %8lu | %7lu | %7lu | %lu\r\n",
               TASK_LOW_NAME,
               (unsigned long)xTaskLowStats.uxCurrentPriority,
               (unsigned long)xTaskLowStats.ulExecutionCount,
               (unsigned long)xTaskLowStats.ulLastElapsedUs,
               (unsigned long)(xTaskLowStats.ulMinElapsedUs == 0xFFFFFFFF ? 0 : xTaskLowStats.ulMinElapsedUs),
               (unsigned long)xTaskLowStats.ulMaxElapsedUs,
               (unsigned long)uxTaskGetStackHighWaterMark(xTaskLowHandle));

        /* Statistik Task Medium */
        printf("  %-12s | %4lu | %5lu | %8lu | %7lu | %7lu | %lu\r\n",
               TASK_MED_NAME,
               (unsigned long)xTaskMedStats.uxCurrentPriority,
               (unsigned long)xTaskMedStats.ulExecutionCount,
               (unsigned long)xTaskMedStats.ulLastElapsedUs,
               (unsigned long)(xTaskMedStats.ulMinElapsedUs == 0xFFFFFFFF ? 0 : xTaskMedStats.ulMinElapsedUs),
               (unsigned long)xTaskMedStats.ulMaxElapsedUs,
               (unsigned long)uxTaskGetStackHighWaterMark(xTaskMedHandle));

        /* Statistik Task High */
        printf("  %-12s | %4lu | %5lu | %8lu | %7lu | %7lu | %lu\r\n",
               TASK_HIGH_NAME,
               (unsigned long)xTaskHighStats.uxCurrentPriority,
               (unsigned long)xTaskHighStats.ulExecutionCount,
               (unsigned long)xTaskHighStats.ulLastElapsedUs,
               (unsigned long)(xTaskHighStats.ulMinElapsedUs == 0xFFFFFFFF ? 0 : xTaskHighStats.ulMinElapsedUs),
               (unsigned long)xTaskHighStats.ulMaxElapsedUs,
               (unsigned long)uxTaskGetStackHighWaterMark(xTaskHighHandle));

        vPrintSeparator('-', 65);

        /* Cetak urutan eksekusi */
        printf("  Urutan Eksekusi: %s\r\n", (char*)cExecOrder);
        printf("[DATA]ORDER,%s,%lu\r\n", (char*)cExecOrder, (unsigned long)xCurrentTick);

        /* Cetak heap info */
        printf("  Heap Free: %lu bytes | Tasks: %lu\r\n",
               (unsigned long)xPortGetFreeHeapSize(),
               (unsigned long)uxTaskGetNumberOfTasks());
        printf("[DATA]HEAP,%lu,%lu\r\n",
               (unsigned long)xPortGetFreeHeapSize(),
               (unsigned long)xCurrentTick);

        /* Tabel vTaskList setiap 3 cycle */
        if (ulMonitorCycle % 3 == 0) {
            printf("\r\n  === vTaskList ===\r\n");
            char pcTaskListBuf[512];
            vTaskList(pcTaskListBuf);
            printf("%s", pcTaskListBuf);
        }

        vPrintSeparator('=', 65);

        /* Delay sampai cycle berikutnya */
        vTaskDelay(pdMS_TO_TICKS(MONITOR_PERIOD_MS));
    }
}

/* ============================ MAIN FUNCTION ============================== */

int main(void) {
    /* Inisialisasi Hardware */
    HAL_Init();
    SystemClock_Config();
    GPIO_Init();
    UART1_Init();
    DWT_Init();

    /* Banner startup */
    printf("\r\n\r\n");
    vPrintSeparator('*', 65);
    printf("*   STM32F103 FreeRTOS - Program 02: Task Priority            *\r\n");
    printf("*   Demonstrasi Preemptive Scheduling & Priority Management   *\r\n");
    vPrintSeparator('*', 65);
    printf("\r\n");

    printf("  [INFO] System Clock : %lu MHz\r\n",
           (unsigned long)(HAL_RCC_GetSysClockFreq() / 1000000));
    printf("  [INFO] CPU Work     : %lu iterasi per task\r\n",
           (unsigned long)CPU_WORK_ITERATIONS);
    printf("  [INFO] Phase Duration: %d ms\r\n", PHASE_DURATION_MS);
    printf("  [INFO] FreeRTOS Heap: %u bytes\r\n", (unsigned int)configTOTAL_HEAP_SIZE);
    printf("\r\n");

