rofiqcp/Praktikum-Sistem-Embedded/Modul-09-FreeRTOS-Task/praktikum/STM32/STM32_02_Task_Priority/src/main.c
    printf("  [HEAP] Sebelum task: %lu bytes free\r\n\r\n",
           (unsigned long)xPortGetFreeHeapSize());

    /* Inisialisasi array urutan eksekusi */
    memset((void*)cExecOrder, 0, sizeof(cExecOrder));

    /* Buat task */
    BaseType_t xResult;

    xResult = xTaskCreate(vTaskLow, TASK_LOW_NAME, TASK_LOW_STACK,
                          NULL, TASK_LOW_PRIORITY, &xTaskLowHandle);
    printf("  [%s] Task '%s' (Prio %d): %s\r\n",
           xResult == pdPASS ? "OK" : "GAGAL", TASK_LOW_NAME, TASK_LOW_PRIORITY,
           xResult == pdPASS ? "Berhasil" : "Gagal");

    xResult = xTaskCreate(vTaskMed, TASK_MED_NAME, TASK_MED_STACK,
                          NULL, TASK_MED_PRIORITY, &xTaskMedHandle);
    printf("  [%s] Task '%s' (Prio %d): %s\r\n",
           xResult == pdPASS ? "OK" : "GAGAL", TASK_MED_NAME, TASK_MED_PRIORITY,
           xResult == pdPASS ? "Berhasil" : "Gagal");

    xResult = xTaskCreate(vTaskHigh, TASK_HIGH_NAME, TASK_HIGH_STACK,
                          NULL, TASK_HIGH_PRIORITY, &xTaskHighHandle);
    printf("  [%s] Task '%s' (Prio %d): %s\r\n",
           xResult == pdPASS ? "OK" : "GAGAL", TASK_HIGH_NAME, TASK_HIGH_PRIORITY,
           xResult == pdPASS ? "Berhasil" : "Gagal");

    xResult = xTaskCreate(vTaskMonitor, MONITOR_TASK_NAME, MONITOR_STACK_SIZE,
                          NULL, MONITOR_PRIORITY, &xMonitorHandle);
    printf("  [%s] Task '%s' (Prio %d): %s\r\n",
           xResult == pdPASS ? "OK" : "GAGAL", MONITOR_TASK_NAME, MONITOR_PRIORITY,
           xResult == pdPASS ? "Berhasil" : "Gagal");

    printf("\r\n  [HEAP] Setelah task: %lu bytes free\r\n",
           (unsigned long)xPortGetFreeHeapSize());
    printf("  [DATA]PHASE,1,Normal,%lu\r\n", (unsigned long)0UL);

    printf("\r\n  Memulai FreeRTOS Scheduler...\r\n");
    vPrintSeparator('=', 65);

    ucSchedulerStarted = 1;
    vTaskStartScheduler();

    /* Seharusnya tidak sampai sini */
    printf("\r\n[FATAL] Scheduler gagal!\r\n");
    for (;;) {
        HAL_GPIO_TogglePin(LED_BUILTIN_PORT, LED_BUILTIN_PIN);
        HAL_Delay(50);
    }
}

/* ====================== HAL CALLBACK OVERRIDES =========================== */

void HAL_MspInit(void) {
    __HAL_RCC_AFIO_CLK_ENABLE();
    __HAL_RCC_PWR_CLK_ENABLE();
    __HAL_AFIO_REMAP_SWJ_NOJTAG();
}
